//Урок 3 Задание 4
//«Морской бой»: вывести на экран массив 10х10, 
//состоящий из символов X и O, где Х — элементы кораблей, а О — свободные клетки.

//Вариант #1:
//формирование массива 10х10
char[,] seaBattle =
{
    {'O','O','X','X','O','O','O','X','O','O'},
    {'O','O','O','O','O','O','O','O','O','O'},
    {'X','O','O','O','O','O','O','O','O','O'},
    {'X','O','O','O','O','X','X','X','O','O'},
    {'X','O','O','O','O','O','O','O','O','X'},
    {'X','O','O','O','X','O','O','O','O','O'},
    {'O','O','O','O','X','O','O','O','O','O'},
    {'X','O','O','O','O','O','X','X','X','O'},
    {'O','X','X','O','O','O','O','O','O','O'},
    {'O','O','O','O','O','O','O','O','X','O'},
};
//Вывод массива
for (int i = 0; i < seaBattle.GetLength(0); i++)
{
    for (int j = 0; j < seaBattle.GetLength(1); j++)
    {
        Console.Write($"{seaBattle[i, j]} ");
    }
    Console.WriteLine();
}


